{"_id":{"$oid":"62247315e9a229ddf5cd45cb"},"movie_id":120.0,"user_name":"robocop","comment":"J.R.R Tolkein's books are wonderful, with memorable characters, an enchanting atmosphere, strong narrative and dialogue and an epic story. Peter Jackson's trilogy mayn't be necessarily true to them, but it does have the memorable characters, the epic story and enchanting atmosphere that the books do. The Fellowship of the Ring is probably the weakest of the three, but it is a very solid start. It is I agree slower in pace to the other two, and there are some talky scenes that drag it down a tad.","date":{"$date":"2010-09-24T00:00:00Z"},"recommended":true}
{"_id":{"$oid":"62247315e9a229ddf5cd45cc"},"movie_id":120.0,"user_name":"Lola Flores","comment":"Oh!!!!!! Lord!!!!!!!!!!!!!!!!!!! I could not understand why `The Lord of the Rings: The Fellowship of the Ring' was nominated for so many Oscars? In fact, my fellow man, I think this film should be shipped right out of every multiplex cinema in the country. I was never engaged to this ring tale about wizards, hobbits, and dragons. I hope the film chokes and has a severe case of `ring around the collar' on oscar night. I did not like anything about this film! The wizards should be locked up in `oz' prison, the hobbits were very earrryyyy, and the dragons should have stayed in their dungeon. All in all, the only finger that would fit in this ring story would be my. ( I think you can fill in the blanks.) * Failure","date":{"$date":"2002-05-22T00:00:00Z"},"recommended":false}
{"_id":{"$oid":"62247315e9a229ddf5cd45cd"},"movie_id":120.0,"user_name":"rbrb","comment":"One newspaper reviewer headlined his write-up of this movie along the lines: :if you don't like this film you don't like movies. he then proceeded to gush over how marvellous the picture is.....along with all the other hobbits elves and dwarfs followers.....hence with few exceptions we are being told we have to love this film and if we don't there is something wrong with us. I remember when the book was in fashion and it was sort of shiek(trendy) to be reading it. Well let me tell you. I could not finish the first page of the book as in my opinion it was trash then and is trash now. So far as the movie is concerned.....ok nice scenery,locations,sets, costumes and special effects......but : 1. far too long at almost 3 hours. 2. A nonsensical storyline. 3. the ending is left up in the air no doubt in the expectation that it will get punters in for the sequel et al. Obviously millions have been wasted on this film.......what a shame... when such could have been spent on either a decent fairy tale story or even a sensible true life type movie.My companion and I almost walked out after an hour and a half and it was only because I fell asleep 3 times...and almost another 3 times that we endured it to the finish. Mind you...the good news is....if you are a cigarette smoker and then you can try to abstain for almost three hours whilst being totally bored by this nonsense. At least with a lot of popcorn washed done with plenty of coke-a-cola I was able to burp amply which caused the youngsters next to me more interest and amusement than anything on the screen. I am told Harry Potter is a far superior picture. But ....to be honest.... if I was given the choice to a) cut my toe nails...b)wash dirty laundry ....c) sit through this film ...I will without doubt go for either a) or b). Still its now 2002 and.... to be generous.....I give it 1 out of 10.","date":{"$date":"2002-01-03T00:00:00Z"},"recommended":false}
{"_id":{"$oid":"62247315e9a229ddf5cd45ce"},"movie_id":120.0,"user_name":"Med-Jasta","comment":"Then for some reason over the years it all changed. These movies came out the last three years of high school for me and I couldn't be more into it. Everybody was. It was a fun time. It even inspired me to start writing myself. But for some reason I'm my mid twenties the movies changed. I guess I did. And to my surprise about ten people that I talked to felt the same way. It really all comes down to Peter Jackson's direction. He is so heavy handed with everything that he does. There's no subtly. The camera is always pushed right in the actors face. Anything worth seeing is never subtle or in the background or on the edge of the frame. It's gets an extreme close up. The acting is terrible. Not the actors fault because the cast is very good. Yes, even Liv Tyler. But the way they were directed is terrible. They are inconsistent as hell. When they are happy they are too happy. Their laughs are too much. The intensity is too intense. Basically these are super cheesy. They are over edited. And really cheap. I actually went back even 10 years after I realized that I no longer liked these to watch the theatrical cut of Fellowship hoping the the overblown extended was the problem. But unfortunately it's not. I wish I could see the movie that I saw as a teenager.","date":{"$date":"2021-04-30T00:00:00Z"},"recommended":false}
{"_id":{"$oid":"62247315e9a229ddf5cd45cf"},"movie_id":120.0,"user_name":"SnoopyStyle","comment":"Dark Lord Sauron forges the One Ring to rule them all. He loses the battle and the ring is lost. It passes through the hands of Isildur, Gollum, and finally lands with Bilbo Baggins. Gandalf (Ian McKellen) arrives in the Shire to visit Bilbo. Bilbo goes on a personal journey leaving the burden of the ring to Frodo (Elijah Wood). Frodo sets off on a quest to save the world with his best friend Samwise (Sean Astin). Along the way, others join this Fellowship of the Ring. Peter Jackson delivers a near-perfect execution of this fantasy classic. The CGI is state-of-the-art but the movie does not get bogged down with battles of massive armies. The action is visceral and thrilling. The characters are compelling and the performances are near perfect. The internal conflicts over the ring actually drive the narrative and ultimately generates great paranoia and isolation for Frodo. This is a great start.","date":{"$date":"2016-03-04T00:00:00Z"},"recommended":true}
{"_id":{"$oid":"62247315e9a229ddf5cd45d0"},"movie_id":120.0,"user_name":"ErToni","comment":"I am not fanatic, though I have read the books a couple of times. My interest in J. R. R. Tolkien goes to his knowledge of the history of language as well as his work in fantasy. I've seen some of the bad animation that was done using his work. I always assumed that this would be the only vehicle that could be used to bring these works to the screen. Now with a new generation of special effects masters, we have a work of art like the world has never seen. Granted, there can never be a definitive work that matches the depth and poetry of the books, but this captures the charm, the wonder, the amazing epic. To see the Shire presented in the first scenes and the party in the home of Bilbo as the creatures of this amazing fantasy are exposed is one of those incredible moments. The story is set up for the ultimate adventure as Frodo paddles out onto that lake, not knowing what has been set in motion. I will leave the real reviews to others. My first thought upon seeing this was, I just hope I survive to see it to its conclusion.","date":{"$date":"2006-03-02T00:00:00Z"},"recommended":true}
{"_id":{"$oid":"62247315e9a229ddf5cd45d1"},"movie_id":122.0,"user_name":"Frodo","comment":"Frodo Baggins and Samwise Gamgee are guided by Gollum to the darkest of Mordor. Gandalf leads the group to to Isengard where they are surprised to find Merry and Pippin having already defeated Saruman. Pippin touches the crystal ball and Sauron mistakenly assumes that he is the ring bearer. Gandalf and Pippin travel to Gondor's capital Minas Tirith but they find mad Denethor on the throne.The quest comes to an end. There is a ton of CGI and it's state of the art. It is fully deserving of the moniker epic. It comes to a climatic apocalyptic battle at Minas Tirith. Then the movie has to keep going for another hour. That can't be helped but the battle in front of the Black Gate is no more than anti-climatic. Also Aragorn releasing the Dead Men struck me as short-sighted heroism. Sometimes, watching something can shine a different light on the idea. It would be better for the Dead Men to not give Aragorn a choice. This movie broke the Oscars by winning eleven. Technically it is far superior and the story is a compelling epic.","date":{"$date":"2007-02-06T00:00:00Z"},"recommended":true}
{"_id":{"$oid":"62247315e9a229ddf5cd45d2"},"movie_id":122.0,"user_name":"claudio_carvalho","comment":"The conclusion of the best movie of fantasy and adventure ever made is in the same level of the other two parts of this splendid story. The journey of Frodo Baggins and his friends in this movie is again outstanding, stunning, a masterpiece. I believe there is nothing else to be said about this fantastic movie. The eleven Oscars, the IMDB User rating of 9,0 with 62,820 votes and the 2,219 reviews are sufficient. I just want to record my enthusiasm with such a film. Unfortunately the same did not happen with the sequence of Matrix, where the first film was excellent, but the sequences were very disappointing. My vote is ten.","date":{"$date":"2004-03-26T00:00:00Z"},"recommended":true}
{"_id":{"$oid":"62247315e9a229ddf5cd45d3"},"movie_id":122.0,"user_name":"lee_eisenberg","comment":"It all comes down to this. The humans and hobbits now have their final battles to fight with the forces of evil. I can't actually say anything about 'The Lord of the Rings: The Return of the King' that does it justice, except to say that it is a great movie in the true sense of the word. Everything that we've awaited in life is summed up in this piece of cinematic history. Every one of the cast members does a masterful job. Therefore, it makes sense that this movie was nominated for 11 Oscars including Best Picture, and won EVERY SINGLE ONE OF THEM. 'LOTR: TROTK' is THE movie that you have to see to believe. It is everything that we like about movies.","date":{"$date":"2005-09-05T00:00:00Z"},"recommended":true}
{"_id":{"$oid":"62247315e9a229ddf5cd45d4"},"movie_id":122.0,"user_name":"phil-932-237806","comment":"I could not watch this properly, far too much shakycam jerking the camera around all over the place, could not see what was going on without feeling dizzy... I recommend you give it a miss unless you want a headache.","date":{"$date":"2019-10-20T00:00:00Z"},"recommended":false}
{"_id":{"$oid":"62247315e9a229ddf5cd45d5"},"movie_id":122.0,"user_name":"morfeus","comment":"Well, as all of the Tolkien's books are nothing more than some dumb fairy-tales , any movie based on Tolkien's book is gonna...(well Jay and Silent Bob fans, you know the quote).I don't like, but I tolerate fanatsy in gerenal, but this is by far! Anyone who likes sitting and watching orcs and goblins speaking single-minded lines about some trashcan-worth ring for 2 hours are welcome. Any sane person KEEP OUT! 0/10","date":{"$date":"2003-11-24T00:00:00Z"},"recommended":false}
{"_id":{"$oid":"62247315e9a229ddf5cd45d6"},"movie_id":122.0,"user_name":"calhobbes99","comment":"This would go down as one of the worst movie of the year. An overhyped tale, I haven't read the book but after seeing the movie i will steer clear of anything to do with the 'lord of the rings'. The 'convinently call-able' ghost army made it the most anti-climatic ending after the 6-8 hrs spent building the tension over the 3 movies. It is the same as the anti-climatic fight at helms deep when gandalf appears to save the day. What was the purpose of the elves. There were so many holes in the plot. The emphasis that Sam wise was not gay was sickening - meant wasting 5 mins in the end showing he marries a woman and has 3 kids. To make it more suitable to the times, Frodo and Sam wise should have just come out of the closet.It is a shame that people have voted it to become in the top 3 movies at imdb.","date":{"$date":"2004-06-04T00:00:00Z"},"recommended":false}
{"_id":{"$oid":"62247315e9a229ddf5cd45d7"},"movie_id":121.0,"user_name":"TheLittleSongbird","comment":"I do love all three films of The Lord of the Rings trilogy, all are visually stunning with wonderful music and strong narratives. The Two Towers is my personal favourite of the three for several reasons. For one thing it is less talky than Fellowship of the Ring, and the pace is a little more secure here. Also the final battle is just breathtaking in the action, direction and in its scope, and very compelling and epic. And some of the characters are developed more here than they were in Fellowship of the Ring primarily Frodo and Aragorn, who were played very well there but a little bland in comparison to here.When it comes to the scope The Two Towers is possibly the biggest in the trilogy. The cinematography is one of the strongest assets, while the scenery, costumes, lighting and make up(the orcs look amazing) are all gorgeous. You can tell a lot of effort went into this and it showed. The music is also darker and perhaps more complex, the story is richer and compelling and the dialogue is thought provoking. People may disagree, but I think The Two Towers is the best directed of the trilogy too.The acting is very good. Elijah Wood is likable enough with a stronger-written character, while Sean Astin's bumbling persona suits Sam really well. Viggo Mortensson is as strong and charismatic as ever. Ian McKellen, Christopher Lee and Bernard Hill are also perfectly cast, but the real revelation in my view with this movie is Gollum. Here Gollum is designed superbly, and Andy Serkis's performance is absolutely phenomenal and Oscar-nod worthy.In conclusion, a fine film and for me my personal favourite of the trilogy. 10/10 Bethany Cox","date":{"$date":"2011-03-08T00:00:00Z"},"recommended":true}
{"_id":{"$oid":"62247315e9a229ddf5cd45d8"},"movie_id":121.0,"user_name":"Lola la piconera","comment":"The fellowship has scattered. Frodo Baggins and Samwise Gamgee, on their journey to Mordor, encounter a vile creature named Gollum. Aragorn, Legolas, and Gimli are chasing the kidnappers of Merry and Pippin. Merry and Pippin manage to escape and befriend tree shepherd Ent Treebeard. Aragorn, Legolas, and Gimli encounter Gandalf reborn as Gandalf the White. They go to Rohan to find King Théoden under the control of evil Saruman.The story and the characters get split up into basically three groups. That back and forth can scatter the tension a little bit. It's a small drawback. I would consider doing Frodo and Samwise in the first half leaving the others to the second half. That would keep continuity flowing. The CGI is world class and nothing is more impressive than Gollum. The movie is able to keep the story compelling in all aspects.","date":{"$date":"2016-07-28T00:00:00Z"},"recommended":true}
{"_id":{"$oid":"62247315e9a229ddf5cd45d9"},"movie_id":121.0,"user_name":"Manporrero69","comment":"This sequel of the best movie of fantasy and adventure ever made can not be seen as another movie, but the second part of a splendid film. The journey of Frodo Baggins and his friends in this movie is also outstanding, stunning, a masterpiece. I believe there is nothing else to be said about this fantastic movie. My vote is ten.","date":{"$date":"2020-07-28T00:00:00Z"},"recommended":true}
{"_id":{"$oid":"62247315e9a229ddf5cd45da"},"movie_id":121.0,"user_name":"Boob Esponja","comment":"This sequel of the best movie of fantasy and adventure ever made can not be seen as another movie, but the second part of a splendid film. The journey of Frodo Baggins and his friends in this movie is also outstanding, stunning, a masterpiece. I believe there is nothing else to be said about this fantastic movie. My vote is ten.","date":{"$date":"2020-07-28T00:00:00Z"},"recommended":true}
{"_id":{"$oid":"62247315e9a229ddf5cd45db"},"movie_id":121.0,"user_name":"Ramon el ruedas","comment":"With the fellowship in splinters, Frodo Baggins (Elijah Wood) and Samwise Gamgee (Sean Astin) continue on their quest to destroy the corrupting ring. Meanwhile, Aragorn (Viggo Mortenson) has his own duties to attend to, as does Gandalf (Ian McKellen). Peter Jackson's midpoint of the trilogy is as great as its predecessor and successor. Every shot is beyond impressive; there isn't any adjective that I can use that would do the movie justice.And Gollum? Now there's an intriguing character, precious. An awe-inspiring, if pitiful, being, he makes you really want to see part 3, just to see what will happen. 'The Lord of the Rings: The Two Towers' is truly one movie that will continue to inspire people for years. A masterpiece.","date":{"$date":"2005-07-20T00:00:00Z"},"recommended":true}
{"_id":{"$oid":"62247315e9a229ddf5cd45dc"},"movie_id":121.0,"user_name":"LacasitoTV","comment":"Let me start off by saying that 'The Two Towers' was definitely worth the Oscar for visual effects. The Golum character is a marvel of the arts and technology. All the visual effects in this movie are better than the first one (where you could even see the wires in the Gandalf-Saruman battle).Now, I believe that they should make only one LOTR, not a trilogy. Take for instance the complete 'Two Towers'. It could be easily omitted in its entirety, as it doesn't really advance the story any further and frankly I believe that the only thing it offers is the great Golum graphics.Just because there are three books, doesn't mean that there must be three movies. Everyone's treating 'Lord of the Rings' like something sacred, which is not.It's like Oscar Wilde said- 'Anyone can write a three volume novel. All it takes is complete ignorance of both life and literature.'","date":{"$date":"2003-07-20T00:00:00Z"},"recommended":false}
{"_id":{"$oid":"62247315e9a229ddf5cd45dd"},"movie_id":121.0,"user_name":"Nosequeponer123","comment":"Let me be the dissenting voice in the wilderness. I don't like this series of movies.The special effects are flat out amazing but the story...ug. I just can't get into it at all. I've seen and sat through the first and third chapters, but the second one (reviewed here) bored me to sleep.I always wondered why, in sci-fi movies that have magic in them, the characters don't just magically arrive at their destination. Or go by air on some creature. These long soul building adventures just are not for me.","date":{"$date":"2006-07-20T00:00:00Z"},"recommended":false}
